{"inst": "Why is it a good idea to walk every day?", "ctxt": "", "req": "Walking is a good exercise for burning calories without causing any damage to joints. People of any age can do it and a few miles a day can result in positive effects on cardiovascular health and general fitness.", "cgr": "oqa"}
{"inst": "Who is the creator of Python?", "ctxt": "", "req": "Guido van Rossum is the father of Python. And the 1st version of Python was released in 1991.", "cgr": "oqa"}
{"inst": "What is a graph?", "ctxt": "", "req": "Graph is a set on nodes that are connected via edges. Edges represent the relationships between the nodes and can have multiple properties like weight or sign. For example the weight of the edge can represent how strong are the relationships between the nodes A and B, while the sign might represent wether these relationships are positive or negative.", "cgr": "gqa"}
{"inst": "Which is a species of fish? Banjo or Guitar", "ctxt": "", "req": "Banjo", "cgr": "clct"}
{"inst": "How do i accept the change", "ctxt": "", "req": "Embrace the change and see the difference", "cgr": "btr"}
{"inst": "What is the difference between a road bike and a mountain bike?", "ctxt": "", "req": "Road bikes are built to be ridden on asphalt and cement surfaces and have thin tires, whereas mountain bikes are built to be ridden on dirt and have wider tires. Road bikes also have more aerodynamic handle bars while mountain bike handle bars a built for less responsive steering while bouncing around off the road.", "cgr": "oqa"}
{"inst": "What is the Masters?", "ctxt": "", "req": "The Masters Tournament is a golf tournament held annually in the first week of April at Augusta National Golf Club in Augusta, Georgia.  The Masters is one of four Major golf tournaments and the only one to be played at the same course every year.  The course is renowned for its iconic holes, impeccable groundskeeping, and colorful flowers that are typically in bloom.  The winner earns a coveted Green Jacket and a lifetime invitation back to compete.  Many players and fans consider The Masters to be their favorite tournament given these traditions and the historical moments that have occurred in past tournaments.", "cgr": "gqa"}
